diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДокументов</name>
    <attributes>
      <name>Договоры</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Если ЗначениеЗаполнено(Объект.Период) Тогда
		ДлительнаяОперация = СоздатьРеализацииНаСервере();
		Оповещение = Новый ОписаниеОповещения("ВыполнитьВФонеЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение);
	Иначе
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните ПЕРИОД!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьРеализацииНаСервере()
	
	ИмяМетода = "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРеализации";
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ИмяМетода, Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьВФонеЗавершение(Результат, ДопПараметры) Экспорт
	
	Таб = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	Объект.СписокДокументов.Очистить();
	Объект.СписокДокументов.Загрузить(Таб);
	Объект.СписокДокументов.Сортировать("Договоры");
	
КонецПроцедуры

#КонецОбласти
